tap "aquasecurity/trivy"
tap "argon/mas"
tap "aws/tap"
tap "filosottile/musl-cross"
tap "genkiroid/cert"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "k1low/tap"
tap "oppara/homebrew"
tap "rcmdnk/rcmdnkpac"
tap "remind101/formulae"
tap "reviewdog/tap"
tap "rhysd/actionlint", "https://github.com/rhysd/actionlint"
tap "shivammathur/php"
tap "teamookla/speedtest"
tap "weaveworks/tap"
tap "yulrizka/tap"
# CLI for Amazon ECS to manage clusters and tasks for development
brew "amazon-ecs-cli"
# Library for command-line editing
brew "readline"
# Automate deployment, configuration, and upgrading
brew "ansible"
# Image manipulation library
brew "jpeg"
# Library for manipulating PNG images
brew "libpng"
# TIFF library and utilities
brew "libtiff"
# Codec library for encoding and decoding AV1 video streams
brew "aom"
# Platform built on V8 to build network applications
brew "node"
# CLI tool for Alexa Skill Kit
brew "ask-cli"
# Automatic configure script builder
brew "autoconf"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# AWS Cloud Development Kit - framework for defining AWS infra as code
brew "aws-cdk", link: false
# Client for Amazon Elastic Beanstalk web service
brew "aws-elasticbeanstalk"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# Official Amazon AWS command-line interface
brew "awscli"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Software library to render fonts
brew "freetype"
# GNU internationalization (i18n) and localization (l10n) library
brew "gettext"
# Perl compatible regular expressions library
brew "pcre"
# Core application library for C
brew "glib"
# Manage compile and link flags for libraries
brew "pkg-config"
# Like cat but displays content with syntax highlighting
brew "ccat"
# GNU multiple precision arithmetic library
brew "gmp"
# Command-line tool for formatting AWS CloudFormation templates
brew "cfn-format"
# Validate CloudFormation templates against the CloudFormation spec
brew "cfn-lint"
# Enables you to reproduce the CircleCI environment locally
brew "circleci"
# Statistics utility to count lines of code
brew "cloc"
# Migemo is a tool that supports Japanese incremental search with Romaji
brew "cmigemo"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Get, unpack, build, and install modules from CPAN
brew "cpanminus"
# Reimplementation of ctags(1)
brew "ctags"
# Secure runtime for JavaScript and TypeScript
brew "deno"
# Load/unload environment variables based on $PWD
brew "direnv"
# Bash, Zsh and Fish completion for Docker
brew "docker-completion"
# Completion script for docker-compose
brew "docker-compose-completion"
# Command-line DNS client
brew "dog"
# General purpose Language Server
brew "efm-langserver"
# Emoji on the command-line :scream:
brew "emojify"
# Program that can automate interactive applications
brew "expect"
# Generic library support script
brew "libtool"
# Asynchronous event library
brew "libevent"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Collection of GNU find, xargs, and locate
brew "findutils"
# CLI program that accepts piped input and presents files for selection
brew "fpp"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Remote repository management made easy
brew "ghq"
# Access GitHub's .gitignore boilerplates
brew "gibo"
# Distributed revision control system
brew "git"
# Git extension for versioning large files
brew "git-lfs"
# Command-line option parsing utility
brew "gnu-getopt"
# Light, temporary commits for git
brew "git-now"
# Prevents you from committing sensitive information to a git repo
brew "git-secrets"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Smarter Dockerfile linter to validate best practices
brew "hadolint"
# Powerful, lightweight programming language
brew "lua"
# Convert source code to formatted text with syntax highlighting
brew "highlight"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Add GitHub support to git on the command-line
brew "hub"
# Configurable static site generator
brew "hugo"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# String tool
brew "intltool"
# Calculate various network masks, etc. from a given IP address
brew "ipcalc"
# Interactive computing in Python
brew "ipython", link: false
# JSON output from a shell
brew "jo"
# Regular expressions library
brew "oniguruma"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Network authentication protocol
brew "krb5"
# Kubernetes command-line interface
brew "kubernetes-cli"
# C XSLT library for GNOME
brew "libxslt"
# C library for reading, creating, and modifying zip archives
brew "libzip"
# Text-based UI library
brew "ncurses"
# Linux virtual machines
brew "lima"
# Fully functional local AWS cloud stack
brew "localstack"
# Powerful multi-lingual file viewer/grep
brew "lv"
# Mac App Store command-line interface
brew "mas"
# Simple tool to make locally trusted development certificates
brew "mkcert"
# Protocol buffers (Google's data interchange format)
brew "protobuf"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Network Kanji code conversion Filter (NKF)
brew "nkf"
# Platform-neutral API for system-level and libc-like functions
brew "nspr"
# Libraries for security-enabled client and server applications
brew "nss"
# Open source computer vision library
brew "opencv"
# Tool for creating identical machine images for multiple platforms
brew "packer"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Python dependency management tool
brew "pipenv"
# Object-relational database system
brew "postgresql"
# Python version management
brew "pyenv"
# Run SQL directly on CSV or TSV files
brew "q"
# QR Code generation
brew "qrencode"
# Command-line tool for working with AWS CloudFormation
brew "rain"
# Reattach process (e.g., tmux) to background
brew "reattach-to-user-namespace"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Wrapper around ripgrep that adds multiple rich file types
brew "ripgrep-all"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Autoformat shell script source code
brew "shfmt"
# Non-validating SQL parser
brew "sqlparse", link: false
# Version control system designed to be a better CVS
brew "subversion"
# Tool to build, change, and version infrastructure
brew "terraform"
# Linter for Terraform files
brew "tflint"
# Multi-platform code-search similar to ack and ag
brew "the_platinum_searcher"
# Text interface for Git repositories
brew "tig"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Command-line unarchiving tools supporting multiple formats
brew "unar"
# Vi 'workalike' with many additional features
brew "vim"
# Internet file retriever
brew "wget"
# Linter for YAML files
brew "yamllint"
# CLI to convert between YAML, TOML, JSON and HCL
brew "yj"
# Next-generation plugin manager for zsh
brew "zplug"
# UNIX shell (command interpreter)
brew "zsh"
# Additional completion definitions for zsh
brew "zsh-completions"
# Scanner for vulnerabilities in container images, file systems, and Git repositories, as well as for configuration issues
brew "aquasecurity/trivy/trivy"
# AWS SAM CLI 🐿 is a tool for local development and testing of Serverless applications
brew "aws/tap/aws-sam-cli"
# Copilot CLI - build, release and operate your container apps on AWS
brew "aws/tap/copilot-cli"
# Linux cross compilers based on musl libc
brew "filosottile/musl-cross/musl-cross"
# Get server's certificate information.
brew "genkiroid/cert/cert"
# Everything you need to get started with Heroku
brew "heroku/brew/heroku"
# ebk is a tiny tool for ebook.
brew "k1low/tap/ebk"
brew "oppara/homebrew/kcode"
brew "oppara/homebrew/keyboardswitcher"
brew "oppara/homebrew/oppara-bin", args: ["HEAD"]
brew "oppara/homebrew/wcwidth"
# Parser of plist in OS X.
brew "rcmdnk/rcmdnkpac/parse-plist"
# Easily assume AWS roles in your terminal
brew "remind101/formulae/assume-role"
# Automated code review tool integrated with any code analysis tools regardless of programming language.
brew "reviewdog/tap/reviewdog"
# Static checker for GitHub Actions workflow files
brew "rhysd/actionlint/actionlint"
# General-purpose scripting language
brew "shivammathur/php/php"
# General-purpose scripting language
brew "shivammathur/php/php@5.6"
# General-purpose scripting language
brew "shivammathur/php/php@7.4"
# Ookla Speedtest
brew "teamookla/speedtest/speedtest"
# The official CLI for Amazon EKS
brew "weaveworks/tap/eksctl"
cask "0xed"
# Application launcher and productivity software
cask "alfred"
# Application uninstaller
cask "appcleaner"
# Securely stores and accesses AWS credentials in a development environment
cask "aws-vault"
cask "colorpicker-plus"
# Browser for SQLite databases
cask "db-browser-for-sqlite"
# Universal database tool and SQL client
cask "dbeaver-community"
# Voice and text chat software
cask "discord"
# App to build and share containerized applications and microservices
cask "docker"
# Simple and visual static web server with collaboration features
cask "fenix"
# Web browser
cask "firefox"
cask "font-cica"
cask "font-migu-1m"
cask "font-migu-2m"
cask "gitter"
# Utility to provide quick look previews for files that aren't natively supported
cask "glance"
# Web browser
cask "google-chrome"
# Tool to scan a website checking for broken links
cask "integrity"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Keyboard customizer
cask "karabiner-elements"
# Open-source keystroke visualizer
cask "keycastr"
cask "launchrocket"
# Controls and monitors all fans on Apple computers
cask "macs-fan-control"
# Create zip files for use on Windows
cask "maczip4win"
# Email tracker, read receipt and spy pixel blocker plugin for Apple Mail
cask "mailtrackerblocker"
# Text editor
cask "mi"
# Create mock APIs in seconds
cask "mockoon"
# Media player
cask "mplayerx"
# Reverse proxy, secure introspectable tunnels to localhost
cask "ngrok"
# Verify system files structure, run miscellaneous maintenance and more
cask "onyx"
# Collaboration platform for API development
cask "postman"
cask "psequel"
# QuickLook plug-in that renders source code with syntax highlighting
cask "qlcolorcode"
# QuickLook generator for Markdown files
cask "qlmarkdown"
cask "qlprettypatch"
cask "qlstephen"
cask "quicklook-colorxml"
cask "quicklook-csv"
cask "quicklook-json"
# MySQL/MariaDB database management
cask "sequel-ace"
# Plugin for AWS CLI to start and end sessions that connect to managed instances
cask "session-manager-plugin"
# Team communication and collaboration software
cask "slack"
# Application for inspecting installer packages
cask "suspicious-package"
# CSV file editor
cask "table-tool"
# Unpacks archive files
cask "the-unarchiver"
# Open-source BitTorrent client
cask "transmission"
# File transfer application
cask "transmit"
# Open-source code editor
cask "visual-studio-code"
# Multimedia player
cask "vlc"
cask "webpquicklook"
cask "wkhtmltopdf"
# Open-source version of the X.Org X Window System
cask "xquartz"
# Downloads music from playlists or channels
cask "youtube-to-mp3"
mas "Be Focused", id: 973134470
mas "CotEditor", id: 1024640650
mas "Display Menu", id: 549083868
mas "ForkLift", id: 412448059
mas "hide.me VPN", id: 953040671
mas "Kindle", id: 405399194
mas "LINE", id: 539883307
mas "Numbers", id: 409203825
mas "Reeder", id: 1529448980
mas "Simplenote", id: 692867256
mas "SiteSucker", id: 442168834
mas "Skitch", id: 425955336
mas "StuffIt Expander", id: 405580712
mas "TweetDeck", id: 485812721
mas "Witch", id: 412485838
