tap "aquasecurity/trivy"
tap "argon/mas"
tap "aws/tap"
tap "daipeihust/tap"
tap "filosottile/musl-cross"
tap "genkiroid/cert"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "k1low/tap"
tap "momentohq/tap"
tap "oppara/homebrew"
tap "rcmdnk/rcmdnkpac"
tap "remind101/formulae"
tap "reviewdog/tap"
tap "rhysd/actionlint", "https://github.com/rhysd/actionlint"
tap "shivammathur/php"
tap "teamookla/speedtest"
tap "weaveworks/tap"
tap "yulrizka/tap"
brew "amazon-ecs-cli"
brew "readline"
brew "python@3.11"
brew "ansible"
brew "libpng"
brew "zstd"
brew "libtiff"
brew "jpeg-xl"
brew "aom"
brew "node"
brew "ask-cli"
brew "autoconf"
brew "automake"
brew "aws-cdk"
brew "aws-elasticbeanstalk"
brew "awscli"
brew "bat"
brew "freetype"
brew "gettext"
brew "glib"
brew "pkg-config"
brew "pcre"
brew "ccat"
brew "gmp"
brew "cfn-format"
brew "cfn-lint"
brew "circleci"
brew "cloc"
brew "cmigemo"
brew "coreutils"
brew "cpanminus"
brew "ctags"
brew "curl"
brew "deno"
brew "direnv"
brew "dog"
brew "efm-langserver"
brew "emojify"
brew "expect"
brew "libevent"
brew "rav1e"
brew "rubberband"
brew "sdl2"
brew "ffmpeg"
brew "findutils"
brew "fpp"
brew "libtool"
brew "fzf"
brew "gh"
brew "ghq"
brew "gibo"
brew "git"
brew "python@3.10"
brew "git-filter-repo"
brew "git-lfs"
brew "gnu-getopt"
brew "git-now"
brew "git-secrets"
brew "glab"
brew "gnu-sed"
brew "go"
brew "grep"
brew "hadolint"
brew "lua"
brew "highlight"
brew "httpd"
brew "httpie"
brew "hub"
brew "hugo"
brew "libomp", link: true
brew "imagemagick"
brew "intltool"
brew "ipcalc"
brew "ipython"
brew "jo"
brew "jpeg"
brew "oniguruma"
brew "jq"
brew "krb5"
brew "kubernetes-cli"
brew "libgpg-error"
brew "libgcrypt"
brew "libxslt"
brew "libzip"
brew "ncurses"
brew "qemu"
brew "lima"
brew "localstack"
brew "lv"
brew "mas"
brew "mkcert"
brew "neovim"
brew "nkf"
brew "nspr"
brew "nss"
brew "protobuf"
brew "opencv"
brew "packer"
brew "pandoc"
brew "pipenv"
brew "prettier"
brew "pyenv"
brew "python@3.8"
brew "python@3.9"
brew "q"
brew "qrencode"
brew "rain"
brew "reattach-to-user-namespace"
brew "ripgrep"
brew "ripgrep-all"
brew "rsync"
brew "shellcheck"
brew "shfmt"
brew "sqlparse"
brew "subversion"
brew "terraform"
brew "tflint"
brew "the_platinum_searcher"
brew "the_silver_searcher"
brew "tig"
brew "tmux"
brew "tree"
brew "unar"
brew "vim"
brew "wget"
brew "php"
brew "wp-cli"
brew "yamllint"
brew "yj"
brew "zplug"
brew "zsh"
brew "zsh-completions"
brew "aquasecurity/trivy/trivy"
brew "aws/tap/aws-sam-cli"
brew "aws/tap/copilot-cli"
brew "daipeihust/tap/im-select"
brew "filosottile/musl-cross/musl-cross"
brew "genkiroid/cert/cert"
brew "k1low/tap/ebk"
brew "momentohq/tap/momento-cli"
brew "oppara/homebrew/kcode"
brew "oppara/homebrew/oppara-bin", args: ["HEAD"]
brew "oppara/homebrew/wcwidth"
brew "rcmdnk/rcmdnkpac/parse-plist"
brew "remind101/formulae/assume-role"
brew "reviewdog/tap/reviewdog"
brew "rhysd/actionlint/actionlint"
brew "shivammathur/php/php"
brew "shivammathur/php/php@8.1"
brew "teamookla/speedtest/speedtest"
brew "weaveworks/tap/eksctl"
cask "1password-cli"
cask "alfred"
cask "all-in-one-messenger"
cask "appcleaner"
cask "aws-vault"
cask "colorpicker-plus"
cask "devtoys"
cask "discord"
cask "docker"
cask "firefox"
cask "font-cica"
cask "font-migu-1m"
cask "font-migu-2m"
cask "gitter"
cask "google-chrome"
cask "integrity"
cask "iterm2"
cask "karabiner-elements"
cask "keycastr"
cask "mailtrackerblocker"
cask "microsoft-edge"
cask "ngrok"
cask "obsidian"
cask "onyx"
cask "postman"
cask "qlcolorcode"
cask "qlmarkdown"
cask "qlprettypatch"
cask "qlstephen"
cask "quicklook-colorxml"
cask "quicklook-csv"
cask "quicklook-json"
cask "sequel-ace"
cask "session-manager-plugin"
cask "shortcat"
cask "slack"
cask "sourcetree"
cask "suspicious-package"
cask "the-unarchiver"
cask "thunderbird"
cask "transmission"
cask "transmit"
cask "visual-studio-code"
cask "vlc"
cask "witch"
mas "Bandwidth+", id: 490461369
mas "CotEditor", id: 1024640650
mas "Display Menu", id: 549083868
mas "ForkLift", id: 412448059
mas "Reeder", id: 1529448980
mas "SiteSucker", id: 442168834
mas "Skitch", id: 425955336
mas "StuffIt Expander", id: 919269455
mas "StuffIt Expander", id: 405580712
mas "TweetDeck", id: 485812721
vscode "ahebrank.yaml2json"
vscode "Arjun.swagger-viewer"
vscode "asvetliakov.vscode-neovim"
vscode "aws-scripting-guy.cform"
vscode "azemoh.one-monokai"
vscode "bmewburn.vscode-intelephense-client"
vscode "cocopon.iceberg-theme"
vscode "DanielThielking.aws-cloudformation-yaml"
vscode "DavidAnson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "EditorConfig.EditorConfig"
vscode "esbenp.prettier-vscode"
vscode "fantasy.markdown-all-in-one-for-web"
vscode "formulahendry.code-runner"
vscode "gerane.Theme-Wombat"
vscode "GitHub.copilot"
vscode "GitHub.copilot-labs"
vscode "golang.go"
vscode "hediet.vscode-drawio"
vscode "ICS.japanese-proofreading"
vscode "jansenfuller.crayon-vscode"
vscode "jebbs.plantuml"
vscode "junstyle.php-cs-fixer"
vscode "kddejong.vscode-cfn-lint"
vscode "liviuschera.noctis"
vscode "mhutchie.git-graph"
vscode "ms-azuretools.vscode-docker"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "ms-vsliveshare.vsliveshare"
vscode "neilbrayfield.php-docblocker"
vscode "octref.vetur"
vscode "oderwat.indent-rainbow"
vscode "PKief.material-icon-theme"
vscode "qhoekman.language-plantuml"
vscode "redhat.vscode-yaml"
vscode "rvest.vs-code-prettier-eslint"
vscode "shardulm94.trailing-spaces"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "vladsaling.Theme-Wombatish"
vscode "vscodevim.vim"
vscode "yzane.markdown-pdf"
vscode "yzhang.markdown-all-in-one"
