tap "adoptopenjdk/openjdk"
tap "aquasecurity/trivy"
tap "argon/mas"
tap "aws/tap"
tap "daipeihust/tap"
tap "filosottile/musl-cross"
tap "gcenx/wine"
tap "genkiroid/cert"
tap "hashicorp/tap"
tap "heroku/brew"
tap "k1low/tap"
tap "koki-develop/tap"
tap "momentohq/tap"
tap "oppara/homebrew"
tap "orangekame3/tap"
tap "pulumi/tap"
tap "rcmdnk/rcmdnkpac"
tap "remind101/formulae"
tap "reviewdog/tap"
tap "rhysd/actionlint", "https://github.com/rhysd/actionlint"
tap "rhysd/git-brws", "https://github.com/rhysd/git-brws"
tap "shivammathur/php"
tap "teamookla/speedtest"
tap "universal-ctags/universal-ctags"
tap "weaveworks/tap"
tap "yulrizka/tap"
brew "readline"
brew "tree"
brew "ansible"
brew "libpng"
brew "libtiff"
brew "jpeg-xl"
brew "aom"
brew "node"
brew "ask-cli"
brew "autoconf"
brew "automake"
brew "aws-cdk"
brew "awscli"
brew "gettext"
brew "ncurses"
brew "oniguruma"
brew "bat"
brew "freetype"
brew "glib"
brew "ccat"
brew "gmp"
brew "cfn-format"
brew "cfn-lint"
brew "pkgconf"
brew "circleci"
brew "cloc"
brew "cmigemo"
brew "coreutils"
brew "cpanminus"
brew "krb5"
brew "deno"
brew "direnv"
brew "dog"
brew "libevent"
brew "efm-langserver"
brew "emojify"
brew "expect"
brew "fd"
brew "ffmpeg"
brew "findutils"
brew "flake8"
brew "flyctl"
brew "fpp"
brew "libtool"
brew "fzf"
brew "gh"
brew "ghq"
brew "gibo"
brew "git"
brew "git-lfs"
brew "gnu-getopt"
brew "git-now"
brew "git-secrets"
brew "gnu-sed"
brew "gnupg"
brew "go"
brew "goimports"
brew "golangci-lint"
brew "graphviz"
brew "hadolint"
brew "lua"
brew "highlight"
brew "httpie"
brew "hub"
brew "hugo"
brew "imagemagick"
brew "intltool"
brew "ipcalc"
brew "ipython"
brew "jo"
brew "jpeg"
brew "jq"
brew "kubernetes-cli"
brew "lefthook"
brew "libxslt"
brew "libzip"
brew "lima"
brew "localstack"
brew "luacheck"
brew "lv"
brew "markdownlint-cli2"
brew "mas"
brew "mkcert"
brew "tree-sitter"
brew "neovim"
brew "nkf"
brew "no-more-secrets"
brew "nspr"
brew "nss"
brew "protobuf"
brew "opencv"
brew "packer"
brew "pandoc"
brew "parallel"
brew "pcre"
brew "php@8.3", link: true
brew "plantuml"
brew "podman"
brew "poppler"
brew "qrencode"
brew "rain"
brew "reattach-to-user-namespace"
brew "resvg"
brew "ripgrep"
brew "ripgrep-all"
brew "ruff"
brew "sevenzip"
brew "shellcheck"
brew "shfmt"
brew "sql-formatter"
brew "sqlparse"
brew "sqruff"
brew "stylua"
brew "subversion"
brew "terraform"
brew "tflint"
brew "tig"
brew "tmux"
brew "unar"
brew "universal-ctags", args: ["HEAD"]
brew "uv"
brew "vercel-cli"
brew "vim"
brew "watchman"
brew "wget"
brew "winetricks"
brew "yamlfmt"
brew "yamllint"
brew "yazi"
brew "yj"
brew "zoxide"
brew "zplug"
brew "zsh"
brew "zsh-completions"
brew "aquasecurity/trivy/trivy"
brew "aws/tap/copilot-cli"
brew "daipeihust/tap/im-select"
brew "filosottile/musl-cross/musl-cross"
brew "genkiroid/cert/cert"
brew "heroku/brew/heroku"
brew "k1low/tap/ebk"
brew "k1low/tap/tbls"
brew "koki-develop/tap/sheep"
brew "momentohq/tap/momento-cli"
brew "oppara/homebrew/kcode"
brew "oppara/homebrew/oppara-bin", args: ["HEAD"]
brew "oppara/homebrew/wcwidth"
brew "orangekame3/tap/stree"
brew "pulumi/tap/pulumi"
brew "rcmdnk/rcmdnkpac/parse-plist"
brew "remind101/formulae/assume-role"
brew "reviewdog/tap/reviewdog"
brew "rhysd/actionlint/actionlint"
brew "rhysd/git-brws/git-brws"
brew "teamookla/speedtest/speedtest"
brew "weaveworks/tap/eksctl"
cask "1password"
cask "1password-cli"
cask "alfred"
cask "amazon-q"
cask "appcleaner"
cask "aws-vault-binary"
cask "claude"
cask "colorpicker-plus"
cask "devtoys"
cask "discord"
cask "docker-desktop"
cask "firefox"
cask "font-cica"
cask "font-hackgen-nerd"
cask "font-intel-one-mono"
cask "font-migu-1m"
cask "font-migu-2m"
cask "font-symbols-only-nerd-font"
cask "gcloud-cli"
cask "gitter"
cask "google-chrome"
cask "integrity"
cask "iterm2"
cask "karabiner-elements"
cask "keyboardcleantool"
cask "keycastr"
cask "ngrok"
cask "onyx"
cask "orbstack"
cask "podman-desktop"
cask "postman"
cask "qlcolorcode"
cask "qlmarkdown"
cask "qlprettypatch"
cask "qlstephen"
cask "quicklook-colorxml"
cask "quicklook-csv"
cask "quicklook-json"
cask "sequel-ace"
cask "session-manager-plugin"
cask "shortcat"
cask "slack"
cask "suspicious-package"
cask "the-unarchiver"
cask "transmission"
cask "transmit"
cask "utm"
cask "visual-studio-code"
cask "vlc"
cask "youtube-to-mp3"
mas "AVIF Converter", id: 1617089333
mas "CotEditor", id: 1024640650
mas "CrystalFetch", id: 6454431289
mas "Display Menu", id: 549083868
mas "ForkLift", id: 412448059
mas "Kindle Classic", id: 405399194
mas "LINE", id: 539883307
mas "Numbers", id: 409203825
mas "Prime Video", id: 545519333
mas "Reeder", id: 1529448980
mas "RetinaCapture", id: 6472719286
mas "Simplenote", id: 692867256
mas "SiteSucker", id: 442168834
mas "Skitch", id: 425955336
vscode "ahebrank.yaml2json"
vscode "amazonwebservices.codewhisperer-for-command-line-companion"
vscode "arjun.swagger-viewer"
vscode "asvetliakov.vscode-neovim"
vscode "aws-scripting-guy.cform"
vscode "azemoh.one-monokai"
vscode "bmewburn.vscode-intelephense-client"
vscode "cocopon.iceberg-theme"
vscode "danielthielking.aws-cloudformation-yaml"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "docker.docker"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "fantasy.markdown-all-in-one-for-web"
vscode "formulahendry.code-runner"
vscode "gerane.theme-wombat"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.copilot-labs"
vscode "golang.go"
vscode "hediet.vscode-drawio"
vscode "jansenfuller.crayon-vscode"
vscode "jebbs.plantuml"
vscode "junstyle.php-cs-fixer"
vscode "kddejong.vscode-cfn-lint"
vscode "lamarcke.kanagawa-black"
vscode "liviuschera.noctis"
vscode "mhutchie.git-graph"
vscode "mrmartian.everforest-moist"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-ceintl.vscode-language-pack-ja"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "ms-vsliveshare.vsliveshare"
vscode "neilbrayfield.php-docblocker"
vscode "octref.vetur"
vscode "oderwat.indent-rainbow"
vscode "pkief.material-icon-theme"
vscode "qhoekman.language-plantuml"
vscode "redhat.vscode-yaml"
vscode "rvest.vs-code-prettier-eslint"
vscode "shardulm94.trailing-spaces"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "sujanshrestha.everest-night-theme"
vscode "yzane.markdown-pdf"
vscode "yzhang.markdown-all-in-one"
